Rhino.DocObjects.RhinoObject.RenderMaterial
Gets and sets the render material associated with this object.
Note that if you are setting the material, the RenderMaterial object must already be in the Rhino.Render.RenderMaterialTable